_src/wiki/2016-09-27-使用Swig封装DLL实现JNI快速开发.org
#+title: 使用Swig封装DLL实现JNI快速开发
#+date: <2016-09-27 20:48>
#+filetags: java swig jni

                         使用Swig封装DLL实现JNI快速开发

* 说在前面
JNI这个话题原来比较老旧，是10年左右的事情，这次翻出来整理是因为又碰到了需求。现
在网上介绍Swig的已经比较多了，有实际例子的比较少，

这里梳理的同时，做一个实际的例子。

JNI技术是在Java最初版本进行开发时就有了，主要实现Java语言与其他语言如
C/C++/Delphi等的交互。

最初用到它是开发物联网的项目，产品需要与各种物联网终端进行适配对接，物联网终端的
各个生产厂家提供的接口五花八门，C，C++，Delphi的，接口封装的形式也是各不相同，为
每一种设备做适配封装成为一个巨大的挑战。

在使用JNI封装了一个设备之后，脑力消耗巨大，因为用JNI封装一个简单的函数和封装几十
上百个函数不是同一个等级的。为了快速解决问题，只能在网上一遍遍搜索，最后发现了
Swig

* Swig简介
Swig的目标是为C/C++开发的程序与其他语言开发的程序之间建立连接。Swig支持的语言包
括：Javascript, Perl, PHP, Python, Tcl and Ruby，C#, Common Lisp (CLISP, Allegro
CL, CFFI, UFFI), D, Go language, Java including Android, Lua, Modula-3, OCAML,
Octave, Scilab and R。可以看出，几乎涵盖了大多数常用语言。

Swig的实现机制是通过定义中间接口描述文件，根据接口描述文件自动生成DLL的封装代码，
包括C/C++封装代码和目标语言的封装代码。当前，

Swig支持C++的如下特性：
- 类
- 类的构造和析构
- 虚函数
- 公共继承（包括多重继承）
- 静态函数
- 函数和方法重载
- 大多数标准运算符的重载
- 引用
- 模板
- 函数指针
- 名字空间

* Swig的安装
Swig支持Windows，Linux和Mac。在Windows平台下，下载SwigWin-[VERSION]安装包即可；
在Linux平台可以从仓库直接安装，如果想使用最新版本，

可以下载代码编译：
#+BEGIN_EXAMPLE
./configure
make
make install

#+END_EXAMPLE
最后的make install需要 root 权限。

* Swig在JNI中的应用
下面以一个实际的JNI封装案例简要介绍Swig的使用。

