wiki/2016-09-27-使用Swig封装DLL实现JNI快速开发.html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://bruceasu.github.io/rss.xml"
      title="RSS feed for https://bruceasu.github.io/"/>
<title>使用Swig封装DLL实现JNI快速开发</title>
<meta name="author" content="Bruce">
<meta name="referrer" content="no-referrer">
<link href= "/styles/org-manual.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rel="stylesheet" href="/styles/font.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/post.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/post_mobile.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/navigatebar.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/navigatebar_mobile.css">
<link rel="stylesheet" href="/theme/highlight.css">

</head>
<body>
<div class="navigatebar">
    <div class="navigatebar-button navigatebar-mine">
        <a href="/index.html">Free World</a>
    </div>
    <div class="navigatebar-slogan">
        「生活可以更简单, 欢迎来到我的开源世界」
    </div>
    <div class="navigatebar-button">
        <a href="/index.html">Home</a>
    </div>
    <div class="navigatebar-button">
        <a href="/tags.html">Tags</a>
    </div>
    <div class="navigatebar-button">
        <a href="/rss.xml">Feeds</a>
    </div>
    <div class="navigatebar-button navigatebar-about">
        <a href="/about.html">About</a>
    </div>
</div>

      <div class="content-area">
<div class="title">使用Swig封装DLL实现JNI快速开发</div>
<div class="category-area"><a href="https://bruceasu.github.io/tags.html#java"><div class="category">java</div></a> <a href="https://bruceasu.github.io/tags.html#swig"><div class="category">swig</div></a> <a href="https://bruceasu.github.io/tags.html#jni"><div class="category">jni</div></a> </div>
<div class="char-counter">2016-09-27</div>
        <div id="content">
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org74908ee">说在前面</a></li>
<li><a href="#org24e081d">Swig简介</a></li>
<li><a href="#org27821fa">Swig的安装</a></li>
<li><a href="#org4bebddd">Swig在JNI中的应用</a>
<ul>
<li><a href="#orged4b148">待封装的DLL及头文件</a></li>
<li><a href="#orgfd6220f">接口描述文件</a></li>
<li><a href="#org9c2ce9b">编译生成代码</a></li>
<li><a href="#org5b83943">调用代码</a></li>
</ul>
</li>
<li><a href="#org1e867a9">附录</a></li>
</ul>
</div>
</nav>
<p>
使用Swig封装DLL实现JNI快速开发
</p>

<div id="outline-container-org74908ee" class="outline-2">
<h2 id="org74908ee">说在前面</h2>
<div class="outline-text-2" id="text-org74908ee">
<p>
JNI这个话题原来比较老旧，是10年左右的事情，这次翻出来整理是因为又碰到了需求。现
在网上介绍Swig的已经比较多了，有实际例子的比较少，
</p>

<p>
这里梳理的同时，做一个实际的例子。
</p>

<p>
JNI技术是在Java最初版本进行开发时就有了，主要实现Java语言与其他语言如
C/C++/Delphi等的交互。
</p>

<p>
最初用到它是开发物联网的项目，产品需要与各种物联网终端进行适配对接，物联网终端的
各个生产厂家提供的接口五花八门，C，C++，Delphi的，接口封装的形式也是各不相同，为
每一种设备做适配封装成为一个巨大的挑战。
</p>

<p>
在使用JNI封装了一个设备之后，脑力消耗巨大，因为用JNI封装一个简单的函数和封装几十
上百个函数不是同一个等级的。为了快速解决问题，只能在网上一遍遍搜索，最后发现了
Swig
</p>
</div>
</div>

<div id="outline-container-org24e081d" class="outline-2">
<h2 id="org24e081d">Swig简介</h2>
<div class="outline-text-2" id="text-org24e081d">
<p>
Swig的目标是为C/C++开发的程序与其他语言开发的程序之间建立连接。Swig支持的语言包
括：Javascript, Perl, PHP, Python, Tcl and Ruby，C#, Common Lisp (CLISP, Allegro
CL, CFFI, UFFI), D, Go language, Java including Android, Lua, Modula-3, OCAML,
Octave, Scilab and R。可以看出，几乎涵盖了大多数常用语言。
</p>

<p>
Swig的实现机制是通过定义中间接口描述文件，根据接口描述文件自动生成DLL的封装代码，
包括C/C++封装代码和目标语言的封装代码。当前，
</p>

<p>
Swig支持C++的如下特性：
</p>
<ul class="org-ul">
<li>类</li>
<li>类的构造和析构</li>
<li>虚函数</li>
<li>公共继承（包括多重继承）</li>
<li>静态函数</li>
<li>函数和方法重载</li>
<li>大多数标准运算符的重载</li>
<li>引用</li>
<li>模板</li>
<li>函数指针</li>
<li>名字空间</li>
</ul>
</div>
</div>

<div id="outline-container-org27821fa" class="outline-2">
<h2 id="org27821fa">Swig的安装</h2>
<div class="outline-text-2" id="text-org27821fa">
<p>
Swig支持Windows，Linux和Mac。在Windows平台下，下载SwigWin-[VERSION]安装包即可；
在Linux平台可以从仓库直接安装，如果想使用最新版本，
</p>

<p>
可以下载代码编译：
</p>
<pre class="example">
./configure
make
make install

</pre>
<p>
最后的make install需要 root 权限。
</p>
</div>
</div>

<div id="outline-container-org4bebddd" class="outline-2">
<h2 id="org4bebddd">Swig在JNI中的应用</h2>
<div class="outline-text-2" id="text-org4bebddd">
<p>
下面以一个实际的JNI封装案例简要介绍Swig的使用。
</p>
</div>
