_src/wiki/2016-09-27-使用Swig封装DLL实现JNI快速开发.org
** 待封装的DLL及头文件

通常拿到的SDK开发接口包括：DLL，.h头文件，.lib文件。下面的示例SDK接口包含：
- RR3036.dll
- RR3036.h
- RR3036.lib
其中，头文件 RR3036.h 的部分内容摘录（仅占三分之一）如下：
#+BEGIN_SRC C
#ifdef RR3036_EXPORTS
#define RR3036_API __declspec(dllexport)
#else
#define RR3036_API __declspec(dllimport)
#endif
// 此类是从 RR3036.dll 导出的
class RR3036_API CRR3036 {
public:
 CRR3036(void);
};
extern RR3036_API int nRR3036;
RR3036_API int fnRR3036(void);
#ifdef __cplusplus
extern "C" {
#endif
RR3036_API int CloseSpecComPort(int FrmHandle);
RR3036_API int CloseComPort();
RR3036_API int GetReaderInformation(unsigned char* ComAdr,	//读写器地址
         unsigned char* VersionInfo,	//软件版本
         unsigned char* ReaderType,	//读写器型号
         unsigned char* TrType,	//支持的协议
         unsigned char* ScanTime,
         int frmComPortindex);
RR3036_API int OpenComPort(int port,unsigned char *ComAdr,int* frmcomportindex);
RR3036_API int AutoOpenComPort(int *port,unsigned char *ComAdr,int *frmcomportindex);
RR3036_API int Inventory(unsigned char *ComAdr,
       unsigned char *state,	//询查模式
       unsigned char *AFI,
       unsigned char *pOUcharUIDList,	//标签DSFID + UID
       unsigned char *pOUcharTagNum,
       int frmcomportindex);
RR3036_API int WriteInventoryScanTime(unsigned char *ComAdr,
           unsigned char *ScanTime,
           int frmComPortindex);
RR3036_API int StayQuiet(unsigned char *ComAdr,
       unsigned char *UID,//要静默标签的UID
       unsigned char *ErrorCode,
       int frmcomportindex);
RR3036_API int Select(unsigned char *ComAdr,
       unsigned char *UID,
       unsigned char *ErrorCode,
       int frmcomportindex);
RR3036_API int ResetToReady(unsigned char *ComAdr,
       unsigned char *state,
       unsigned char *UID,
       unsigned char *ErrorCode,
       int frmcomportindex);
RR3036_API int ReadSingleBlock(unsigned char *ComAdr,
          unsigned char *state,	//读模式选择
          unsigned char *UID,
          unsigned char blockNumber,	//块号
          unsigned char *BlockSecStatus,	//安全状态字
          unsigned char *Data,	//块数据
          unsigned char *ErrorCode,
          int frmcomportindex);
RR3036_API int WriteSingleBlock(unsigned char *ComAdr,
        unsigned char *state,	//读模式选择
        unsigned char *UID,
        unsigned char blockNumber,	//块号
        unsigned char *Data,	//要写入的数据
        unsigned char *ErrorCode,
        int frmcomportindex);
RR3036_API int ReadMultipleBlock(unsigned char *ComAdr,
         unsigned char *state,	//读模式选择
         unsigned char *UID,
         unsigned char BlockNum,	//起始块号
         unsigned char BlockCount,	//块数量
         unsigned char *BlockSecStatus,//安全状态字
         unsigned char *Data,	//块数据
         unsigned char *ErrorCode,
         int frmcomportindex);
......
#+END_SRC

