wiki/2016-09-27-使用Swig封装DLL实现JNI快速开发.html

<div id="outline-container-orged4b148" class="outline-3">
<h3 id="orged4b148">待封装的DLL及头文件</h3>
<div class="outline-text-3" id="text-orged4b148">
<p>
通常拿到的SDK开发接口包括：DLL，.h头文件，.lib文件。下面的示例SDK接口包含：
</p>
<ul class="org-ul">
<li>RR3036.dll</li>
<li>RR3036.h</li>
<li>RR3036.lib</li>
</ul>
<p>
其中，头文件 RR3036.h 的部分内容摘录（仅占三分之一）如下：
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="font-weight: bold;">#ifdef</span> RR3036_EXPORTS
<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">RR3036_API</span> <span style="font-weight: bold;">__declspec</span>(dllexport)
<span style="font-weight: bold;">#else</span>
<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">RR3036_API</span> <span style="font-weight: bold;">__declspec</span>(dllimport)
<span style="font-weight: bold;">#endif</span>
<span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#27492;&#31867;&#26159;&#20174; RR3036.dll &#23548;&#20986;&#30340;</span>
class <span style="font-weight: bold; text-decoration: underline;">RR3036_API</span> <span style="font-weight: bold; font-style: italic;">CRR3036</span> {
<span style="font-weight: bold; text-decoration: underline;">public</span>:
 CRR3036(<span style="font-weight: bold; text-decoration: underline;">void</span>);
};
<span style="font-weight: bold;">extern</span> <span style="font-weight: bold; text-decoration: underline;">RR3036_API</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">nRR3036</span>;
<span style="font-weight: bold; text-decoration: underline;">RR3036_API</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">fnRR3036</span>(<span style="font-weight: bold; text-decoration: underline;">void</span>);
<span style="font-weight: bold;">#ifdef</span> __cplusplus
<span style="font-weight: bold;">extern</span> <span style="font-style: italic;">"C"</span> {
<span style="font-weight: bold;">#endif</span>
<span style="font-weight: bold; text-decoration: underline;">RR3036_API</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">CloseSpecComPort</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">FrmHandle</span>);
<span style="font-weight: bold; text-decoration: underline;">RR3036_API</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">CloseComPort</span>();
<span style="font-weight: bold; text-decoration: underline;">RR3036_API</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">GetReaderInformation</span>(<span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span>* <span style="font-weight: bold; font-style: italic;">ComAdr</span>,      <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#35835;&#20889;&#22120;&#22320;&#22336;</span>
         <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span>* <span style="font-weight: bold; font-style: italic;">VersionInfo</span>,    <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#36719;&#20214;&#29256;&#26412;</span>
         <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span>* <span style="font-weight: bold; font-style: italic;">ReaderType</span>,     <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#35835;&#20889;&#22120;&#22411;&#21495;</span>
         <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span>* <span style="font-weight: bold; font-style: italic;">TrType</span>, <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#25903;&#25345;&#30340;&#21327;&#35758;</span>
         <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span>* <span style="font-weight: bold; font-style: italic;">ScanTime</span>,
         <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">frmComPortindex</span>);
<span style="font-weight: bold; text-decoration: underline;">RR3036_API</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">OpenComPort</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">port</span>,<span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">ComAdr</span>,<span style="font-weight: bold; text-decoration: underline;">int</span>* <span style="font-weight: bold; font-style: italic;">frmcomportindex</span>);
<span style="font-weight: bold; text-decoration: underline;">RR3036_API</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">AutoOpenComPort</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">port</span>,<span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">ComAdr</span>,<span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">frmcomportindex</span>);
<span style="font-weight: bold; text-decoration: underline;">RR3036_API</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">Inventory</span>(<span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">ComAdr</span>,
       <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">state</span>,    <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#35810;&#26597;&#27169;&#24335;</span>
       <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">AFI</span>,
       <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">pOUcharUIDList</span>,   <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#26631;&#31614;DSFID + UID</span>
       <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">pOUcharTagNum</span>,
       <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">frmcomportindex</span>);
<span style="font-weight: bold; text-decoration: underline;">RR3036_API</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">WriteInventoryScanTime</span>(<span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">ComAdr</span>,
           <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">ScanTime</span>,
           <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">frmComPortindex</span>);
<span style="font-weight: bold; text-decoration: underline;">RR3036_API</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">StayQuiet</span>(<span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">ComAdr</span>,
       <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">UID</span>,<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#35201;&#38745;&#40664;&#26631;&#31614;&#30340;UID</span>
       <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">ErrorCode</span>,
       <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">frmcomportindex</span>);
<span style="font-weight: bold; text-decoration: underline;">RR3036_API</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">Select</span>(<span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">ComAdr</span>,
       <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">UID</span>,
       <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">ErrorCode</span>,
       <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">frmcomportindex</span>);
<span style="font-weight: bold; text-decoration: underline;">RR3036_API</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">ResetToReady</span>(<span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">ComAdr</span>,
       <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">state</span>,
       <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">UID</span>,
       <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">ErrorCode</span>,
       <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">frmcomportindex</span>);
<span style="font-weight: bold; text-decoration: underline;">RR3036_API</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">ReadSingleBlock</span>(<span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">ComAdr</span>,
          <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">state</span>, <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#35835;&#27169;&#24335;&#36873;&#25321;</span>
          <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">UID</span>,
          <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> <span style="font-weight: bold; font-style: italic;">blockNumber</span>,    <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#22359;&#21495;</span>
          <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">BlockSecStatus</span>,        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#23433;&#20840;&#29366;&#24577;&#23383;</span>
          <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">Data</span>,  <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#22359;&#25968;&#25454;</span>
          <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">ErrorCode</span>,
          <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">frmcomportindex</span>);
<span style="font-weight: bold; text-decoration: underline;">RR3036_API</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">WriteSingleBlock</span>(<span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">ComAdr</span>,
        <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">state</span>,   <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#35835;&#27169;&#24335;&#36873;&#25321;</span>
        <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">UID</span>,
        <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> <span style="font-weight: bold; font-style: italic;">blockNumber</span>,      <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#22359;&#21495;</span>
        <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">Data</span>,    <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#35201;&#20889;&#20837;&#30340;&#25968;&#25454;</span>
        <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">ErrorCode</span>,
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">frmcomportindex</span>);
<span style="font-weight: bold; text-decoration: underline;">RR3036_API</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">ReadMultipleBlock</span>(<span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">ComAdr</span>,
         <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">state</span>,  <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#35835;&#27169;&#24335;&#36873;&#25321;</span>
         <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">UID</span>,
         <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> <span style="font-weight: bold; font-style: italic;">BlockNum</span>,        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#36215;&#22987;&#22359;&#21495;</span>
         <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> <span style="font-weight: bold; font-style: italic;">BlockCount</span>,      <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#22359;&#25968;&#37327;</span>
         <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">BlockSecStatus</span>,<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#23433;&#20840;&#29366;&#24577;&#23383;</span>
         <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">Data</span>,   <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#22359;&#25968;&#25454;</span>
         <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">ErrorCode</span>,
         <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">frmcomportindex</span>);
......
</pre>
</div>
</div>
</div>
