_src/wiki/2016-09-27-使用Swig封装DLL实现JNI快速开发.org
** 接口描述文件
我们需要告诉Swig，我们的接口定义头文件是什么，要封装的主类（以Java为例）是什么，
接口头文件是否还依赖其他头文件，需要在交互过程中对哪些类型做什么样的映射封装，根
据上述信息生成 RR3036.i 的接口描述文件，具体如下：
#+BEGIN_SRC swig
%module RR3036
%{
%include <windows.i>
%include "RR3036.h"
%}
%include <windows.i>
%include "RR3036.h"
%include cpointer.i
%pointer_functions(int, intp);
%pointer_functions(unsigned char, shortp);
%include "carrays.i"
%array_functions(unsigned char, shortArray);

#+END_SRC

如上所示，我们要封装成的Java代码主类为 RR3036（通过%module描述）。定义int型/短整
型指针的类型映射封装。

由上面可以看出，这个过程我们几乎不需要考虑接口头文件中的具体接口方法定义。关于接
口描述文件定义及类型封装请参考Swig帮助文档。

** 编译生成代码
接口描述文件RR3036.i准备好之后就可以调用Swig命令生成封装代码，具体命令如下：
: swig -c++ -java -package rr3036.api -outdir src/java/rr3036/api RR3036.i
生成的代码文件（本例）主要包括：

两个C++封装文件：
- JNI_RR3036API.cpp
- RR3036_wrap.cxx

注意，此文件中的 =%include <windows.i>=  =%include "RR3036.i"= 需要调整才能编译
多个Java封装文件：

- CRR3036.java
- RR3036.java # 要调用的主类
- RR3036JNI.java
- SWIGTYPE_p_int.java
- SWIGTYPE_p_unsigned_char.java

对上述代码分别进行编译。

备注：
#+BEGIN_QUOTE
生成的C++封装代码在Linux下的编译，在Swig中有单独说明，可参考。
#+END_QUOTE

详细编译参数，请参考Swig帮助文档。

** 调用代码
将生成的 =JNI_RR3036API.dll= 与 接口 =RR3036.DLL= 通过 =System.load= 等方法加载后调用
即可。本例代码可从swig-jni-rr3036下载。

* 附录
[Android] Jni中C++和Java的数据类型的对应关系

| Java类型  | 本地类型      | 描述                                     |
|-----------+---------------+------------------------------------------|
| boolean   | jboolean      | C/C++8位整型                             |
| byte      | jbyte         | C/C++带符号的8位整型                     |
| char      | jchar         | C/C++无符号的16位整型                    |
| short     | jshort        | C/C++带符号的16位整型                    |
| int       | jint          | C/C++带符号的32位整型                    |
| long      | jlong         | C/C++带符号的64位整型e                   |
| float     | jfloat        | C/C++32位浮点型                          |
| double    | jdouble       | C/C++64位浮点型                          |
| Object    | jobject       | 任何Java对象，或者没有对应java类型的对象 |
| Class     | jclass        | Class对象                                |
| String    | jstring       | 字符串对象                               |
| Object[]  | jobjectArray  | 任何对象的数组                           |
| boolean[] | jbooleanArray | 布尔型数组                               |
| byte[]    | jbyteArray    | 比特型数组                               |
| char[]    | jcharArray    | 字符型数组                               |
| short[]   | jshortArray   | 短整型数组                               |
| int[]     | jintArray     | 整型数组                                 |
| long[]    | jlongArray    | 长整型数组                               |
| float[]   | jfloatArray   | 浮点型数组                               |
| double[]  | jdoubleArray  | 双浮点型数组                             |
