wiki/2016-09-27-使用Swig封装DLL实现JNI快速开发.html

<div id="outline-container-orgfd6220f" class="outline-3">
<h3 id="orgfd6220f">接口描述文件</h3>
<div class="outline-text-3" id="text-orgfd6220f">
<p>
我们需要告诉Swig，我们的接口定义头文件是什么，要封装的主类（以Java为例）是什么，
接口头文件是否还依赖其他头文件，需要在交互过程中对哪些类型做什么样的映射封装，根
据上述信息生成 RR3036.i 的接口描述文件，具体如下：
</p>
<div class="org-src-container">
<pre class="src src-swig">%module RR3036
%{
%include &lt;windows.i&gt;
%include "RR3036.h"
%}
%include &lt;windows.i&gt;
%include "RR3036.h"
%include cpointer.i
%pointer_functions(int, intp);
%pointer_functions(unsigned char, shortp);
%include "carrays.i"
%array_functions(unsigned char, shortArray);

</pre>
</div>

<p>
如上所示，我们要封装成的Java代码主类为 RR3036（通过%module描述）。定义int型/短整
型指针的类型映射封装。
</p>

<p>
由上面可以看出，这个过程我们几乎不需要考虑接口头文件中的具体接口方法定义。关于接
口描述文件定义及类型封装请参考Swig帮助文档。
</p>
</div>
</div>

<div id="outline-container-org9c2ce9b" class="outline-3">
<h3 id="org9c2ce9b">编译生成代码</h3>
<div class="outline-text-3" id="text-org9c2ce9b">
<p>
接口描述文件RR3036.i准备好之后就可以调用Swig命令生成封装代码，具体命令如下：
</p>
<pre class="example">
swig -c++ -java -package rr3036.api -outdir src/java/rr3036/api RR3036.i

</pre>
<p>
生成的代码文件（本例）主要包括：
</p>

<p>
两个C++封装文件：
</p>
<ul class="org-ul">
<li>JNI<sub>RR3036API.cpp</sub></li>
<li>RR3036<sub>wrap.cxx</sub></li>
</ul>

<p>
注意，此文件中的 <code>%include &lt;windows.i&gt;</code>  <code>%include "RR3036.i"</code> 需要调整才能编译
多个Java封装文件：
</p>

<ul class="org-ul">
<li>CRR3036.java</li>
<li>RR3036.java # 要调用的主类</li>
<li>RR3036JNI.java</li>
<li>SWIGTYPE<sub>p</sub><sub>int.java</sub></li>
<li>SWIGTYPE<sub>p</sub><sub>unsigned</sub><sub>char.java</sub></li>
</ul>

<p>
对上述代码分别进行编译。
</p>

<p>
备注：
</p>
<blockquote>
<p>
生成的C++封装代码在Linux下的编译，在Swig中有单独说明，可参考。
</p>
</blockquote>

<p>
详细编译参数，请参考Swig帮助文档。
</p>
</div>
</div>

<div id="outline-container-org5b83943" class="outline-3">
<h3 id="org5b83943">调用代码</h3>
<div class="outline-text-3" id="text-org5b83943">
<p>
将生成的 <code>JNI_RR3036API.dll</code> 与 接口 <code>RR3036.DLL</code> 通过 <code>System.load</code> 等方法加载后调用
即可。本例代码可从swig-jni-rr3036下载。
</p>
</div>
</div>
</div>

<div id="outline-container-org1e867a9" class="outline-2">
<h2 id="org1e867a9">附录</h2>
<div class="outline-text-2" id="text-org1e867a9">
<p>
[Android] Jni中C++和Java的数据类型的对应关系
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Java类型</th>
<th scope="col" class="org-left">本地类型</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">boolean</td>
<td class="org-left">jboolean</td>
<td class="org-left">C/C++8位整型</td>
</tr>

<tr>
<td class="org-left">byte</td>
<td class="org-left">jbyte</td>
<td class="org-left">C/C++带符号的8位整型</td>
</tr>

<tr>
<td class="org-left">char</td>
<td class="org-left">jchar</td>
<td class="org-left">C/C++无符号的16位整型</td>
</tr>

<tr>
<td class="org-left">short</td>
<td class="org-left">jshort</td>
<td class="org-left">C/C++带符号的16位整型</td>
</tr>

<tr>
<td class="org-left">int</td>
<td class="org-left">jint</td>
<td class="org-left">C/C++带符号的32位整型</td>
</tr>

<tr>
<td class="org-left">long</td>
<td class="org-left">jlong</td>
<td class="org-left">C/C++带符号的64位整型e</td>
</tr>

<tr>
<td class="org-left">float</td>
<td class="org-left">jfloat</td>
<td class="org-left">C/C++32位浮点型</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">jdouble</td>
<td class="org-left">C/C++64位浮点型</td>
</tr>

<tr>
<td class="org-left">Object</td>
<td class="org-left">jobject</td>
<td class="org-left">任何Java对象，或者没有对应java类型的对象</td>
</tr>

<tr>
<td class="org-left">Class</td>
<td class="org-left">jclass</td>
<td class="org-left">Class对象</td>
</tr>

<tr>
<td class="org-left">String</td>
<td class="org-left">jstring</td>
<td class="org-left">字符串对象</td>
</tr>

<tr>
<td class="org-left">Object[]</td>
<td class="org-left">jobjectArray</td>
<td class="org-left">任何对象的数组</td>
</tr>

<tr>
<td class="org-left">boolean[]</td>
<td class="org-left">jbooleanArray</td>
<td class="org-left">布尔型数组</td>
</tr>

<tr>
<td class="org-left">byte[]</td>
<td class="org-left">jbyteArray</td>
<td class="org-left">比特型数组</td>
</tr>

<tr>
<td class="org-left">char[]</td>
<td class="org-left">jcharArray</td>
<td class="org-left">字符型数组</td>
</tr>

<tr>
<td class="org-left">short[]</td>
<td class="org-left">jshortArray</td>
<td class="org-left">短整型数组</td>
</tr>

<tr>
<td class="org-left">int[]</td>
<td class="org-left">jintArray</td>
<td class="org-left">整型数组</td>
</tr>

<tr>
<td class="org-left">long[]</td>
<td class="org-left">jlongArray</td>
<td class="org-left">长整型数组</td>
</tr>

<tr>
<td class="org-left">float[]</td>
<td class="org-left">jfloatArray</td>
<td class="org-left">浮点型数组</td>
</tr>

<tr>
<td class="org-left">double[]</td>
<td class="org-left">jdoubleArray</td>
<td class="org-left">双浮点型数组</td>
</tr>
</tbody>
</table>
</div>
</div>

        </div>    </div>
    <div id="postamble" class="status"><div id="archive" style="padding-top: 3em; padding-bottom: 2em;"><a href="/archive.html">其它文章</a></div><script src="/js/av-min-1.5.0.js"></script>    </div>
</body>
</html>
